Revit 2026 API

# ViewShowActiveWorkPlane Method

---

Show the active work plane of the view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void ShowActiveWorkPlane()
```
```vb
Public Sub ShowActiveWorkPlane
```
```cpp
public:
void ShowActiveWorkPlane()
```
```fsharp
member ShowActiveWorkPlane : unit -> unit
```

| Exception | Condition |
| --- | --- |
| InvalidOperationException | Thrown when there is no active sketch plane, or when an error occurs during setting the sketch plane visibility. |

If this method is invoked while the current work plane is hidden, only the outline of the updated work plane will be shown immediately. The updated sketch plane will be shown fully after the current transaction is committed. Therefore it is recommended the Add-On commits the transaction before performing UI operations (for example, PickPoint).

#### Reference

View Class

Autodesk.Revit.DB Namespace